{
  "drivers": {
    "Max Verstappen": {
      "tldr": "Verstappen arrives in Austin on a heater: P2 Singapore after back‑to‑back wins at Monza and Baku, and P2 at home in Zandvoort. He’s a COTA ace with wins in 2022 and 2023 and a podium in 2024—expect him to leverage the Sprint format and medium/hard pace to pressure McLaren.",
      "full": "## Current Form\n- Last five GPs: P2 Singapore, P1 Azerbaijan, P1 Italy (Monza), P2 Netherlands (Zandvoort), P4 Belgium. Momentum is strong after two wins and two seconds in the last four.  \n- Championship: P3 with 273 pts, 63 behind leader Oscar Piastri with six rounds to go; McLaren has clinched the Constructors’.  \n- Note from Singapore: Verstappen felt traffic from Norris cost him a shot at pole; he still converted to P2 on Sunday.",
      "stakes_level": "high",
      "perfect_quali": "Pole position",
      "perfect_race": "Victory",
      "good_quali": "P2–P4",
      "good_race": "Podium finish",
      "key_strengths": [
        "High‑speed direction change through S1 esses",
        "late‑braking/pass execution into T12",
        "tyre and pace management on Medium/Hard"
      ],
      "watch_for": "Whether Red Bull trims wing for the T11–T12 straight or loads downforce for S1; the Sprint will reveal if their trade‑off beats McLaren’s top‑speed delta."
    },
    "Yuki Tsunoda": {
      "tldr": "Tsunoda arrives in Austin off a mixed run (P12 Singapore, but a season‑best P6 in Baku) and historically goes well at COTA, including fastest lap in 2023. Key watch: converting a Sprint weekend’s extra mileage into qualifying consistency and track‑limits discipline at T19.",
      "full": "## Current Form\n- Last 4 GPs: Singapore P12, Azerbaijan P6 (best Red Bull result for him this year), Italy P13, Netherlands P9. That’s modest momentum with a clear high point in Baku and solid race craft at Zandvoort.  \n- Season picture: Tsunoda sits in the lower midfield on points (around P17 with 20 pts after Baku; no change in Singapore), needing consistent Q3s to climb.",
      "stakes_level": "medium",
      "perfect_quali": "P6–P8",
      "perfect_race": "P5–P7",
      "good_quali": "P9–P12 (Q3 berth ideal)",
      "good_race": "Points finish (P8–P10)",
      "key_strengths": [
        "High‑speed direction change in S‑curves",
        "late‑braking into T12",
        "tyre nursing on Medium/Hard"
      ],
      "watch_for": "Whether he keeps it within the white lines at T19 while maintaining exit speed out of T11 to create DRS passes into T12 — the combo that can turn a Q3 start into double points across Sprint and GP."
    },
    "Lewis Hamilton": {
      "tldr": "Hamilton arrives at COTA with strong personal pedigree but a modest 2025 Ferrari baseline. Recent results (P8 Singapore after a penalty, P8 Baku, P6 Monza, DNF Zandvoort, P7 Spa) set a realistic target of “high points, outside shot at a podium,” helped by a sprint-format weekend and tyre nomination that could reward Ferrari’s race craft.",
      "full": "## Current Form\n- Results trend: Singapore P8 after a post‑race penalty; Azerbaijan P8; Italy P6; Dutch GP DNF (crash); Belgium P7. He sits P6 in the Drivers’ standings on 127 points. McLaren has already clinched the Constructors’ title.\n- Ferrari’s own expectation management remains conservative, with team voices suggesting outright wins are unlikely on current pace; Hamilton himself has said podiums are “off the cards for a while” on merit.",
      "stakes_level": "medium",
      "perfect_quali": "P2–P3",
      "perfect_race": "Podium finish",
      "good_quali": "P4–P6",
      "good_race": "P5–P7",
      "key_strengths": [
        "First‑sector rhythm through the esses",
        "late‑braking racecraft into T1/T12",
        "tyre management over varied stints"
      ],
      "watch_for": "How Ferrari splits Sprint vs GP setups under the relaxed parc fermé—Hamilton may run a lower‑risk Sprint configuration, then pivot for race‑pace and tyre life on Saturday evening."
    },
    "Charles Leclerc": {
      "tldr": "Leclerc returns to COTA as the defending race winner, but 2025 form says “best of the rest” is the realistic target. Watch how Ferrari balances ride‑height/kerb compliance over the bumps and uses the Sprint’s parc fermé reset to chase a podium.",
      "full": "## Current Form\n- Mixed but steady: P3 Belgium, DNF Netherlands, P4 Italy, P9 Azerbaijan, P6 Singapore. He sits P5 in the Drivers’ standings (173 pts); Ferrari are P3 in Constructors in a tight fight behind Mercedes and just ahead of Red Bull.\n- Recent tone from Leclerc has been cautious, calling the 2025 Ferrari “unpredictable” and downplaying chances of a win this year. Momentum is about maximizing points, not outright victories.",
      "stakes_level": "medium",
      "perfect_quali": "P1–P2",
      "perfect_race": "Podium finish",
      "good_quali": "P4–P6",
      "good_race": "P4–P6",
      "key_strengths": [
        "Late‑braking and rotation into T1/T12",
        "high‑speed direction change through the Esses",
        "tire management on Medium/Hard"
      ],
      "watch_for": "Ferrari’s ride‑height/kerb‑compliance tweak between the Sprint and GP qualifying — if they nail it, Leclerc’s podium odds jump at a track he won last year."
    },
    "Lando Norris": {
      "tldr": "Norris arrives in Austin right in the title fight after P3 in Singapore and a strong late‑season run. Watch for outright pace in the high‑speed S‑curves, but zero‑tolerance on Turn 19 track limits after last year’s penalty.",
      "full": "## Current Form\nNorris’s last five: P3 Singapore (Oct 5), P7 Azerbaijan (Sep 21), P2 Italy/Monza (Sep 7), DNF Netherlands/Zandvoort (Aug 31), P2 Belgium/Spa (Jul 27).  \nMcLaren clinched the 2025 Constructors’ Championship in Singapore; in Drivers’, Oscar Piastri leads Norris by 22 points as the season heads to Austin.",
      "stakes_level": "high",
      "perfect_quali": "Pole position",
      "perfect_race": "Victory",
      "good_quali": "P2–P3",
      "good_race": "Podium finish",
      "key_strengths": [
        "High‑speed S‑curves commitment",
        "late‑braking into T1/T12",
        "tyre management over long stints"
      ],
      "watch_for": "How tightly he manages Turn 19 track limits after last year’s penalty while balancing intra‑team rivalry in the Sprint and GP."
    },
    "Oscar Piastri": {
      "tldr": "Piastri arrives in Austin leading the Drivers’ Championship after P4 in Singapore, but with tensions simmering after a feisty Norris overtake. Watch for his pace through the Esses and how McLaren manage team orders into T1/T12 on a Sprint weekend.",
      "full": "## Current Form\nPiastri leads the championship by 22 points over team‑mate Lando Norris after finishing P4 in Singapore, where McLaren also sealed the Constructors’ title. Before that: DNF in Baku after a Lap 1 crash, P3 at Monza, and wins at Zandvoort and Spa. Momentum is good overall despite the Baku blip and the Singapore intra‑team flashpoint.",
      "stakes_level": "high",
      "perfect_quali": "Pole position",
      "perfect_race": "Victory",
      "good_quali": "P2–P4",
      "good_race": "Podium finish",
      "key_strengths": [
        "High‑speed change of direction through the Esses",
        "late‑braking into T1/T12",
        "tyre management on Medium/Hard"
      ],
      "watch_for": "Lap‑1 aggression into Turn 1 and how McLaren handle team orders if Piastri and Norris converge again during Sprint/GP."
    },
    "George Russell": {
      "tldr": "Russell arrives in Austin off a statement win in Singapore and an earlier victory in Canada, with solid P4/P5 finishes in between signaling upward Mercedes momentum. Expect him to attack the Esses and heavy‑brake zones—but the bumps and Turn 19 track limits will demand discipline across Sprint and GP.",
      "full": "## Current Form\n- Fresh from winning the Singapore GP from pole—his second victory of 2025—Russell sits P4 in the Drivers’ standings as Mercedes hold P2 in the Constructors’.\n- Last 5 results snapshot: Singapore P1, Monza P5, Zandvoort P4, Spa P5, Canada P1 (also from pole). Momentum is genuine heading into COTA.\n- Off‑track, Singapore weekend reporting noted active Mercedes contract talks around Russell—added context to a strong run of form.",
      "stakes_level": "medium",
      "perfect_quali": "P1–P3",
      "perfect_race": "Victory",
      "good_quali": "P4–P6",
      "good_race": "P4–P6",
      "key_strengths": [
        "High‑speed direction change",
        "late‑braking confidence",
        "tyre management"
      ],
      "watch_for": "How aggressively Mercedes runs ride height after the Sprint—and whether Russell keeps laps clean at Turn 19 under windy, track‑limits‑sensitive conditions."
    },
    "Kimi Antonelli": {
      "tldr": "Antonelli arrives in Austin off a solid P5 in Singapore and an upswing since the break, but he still needs a clean, penalty‑free weekend. Watch qualifying execution and track‑limits discipline at T19 as Mercedes balances ride height over COTA’s bumps and maximizes the C1/C3/C4 tyre set.",
      "full": "## Current Form\n- Last four GPs: Singapore P5 (started P4), Azerbaijan P4, Italy P9 after a 5s penalty, Dutch GP dropped from P6 on the road to P16 with penalties. He sits P7 in the standings on 78 points; season highlights include a maiden podium (P3) in Canada and becoming the youngest ever F1 race leader and fastest‑lap holder at Suzuka.",
      "stakes_level": "medium",
      "perfect_quali": "P1–P3",
      "perfect_race": "Podium finish",
      "good_quali": "P4–P6",
      "good_race": "Top‑six/solid points",
      "key_strengths": [
        "High‑speed change of direction",
        "late‑braking racecraft",
        "tyre management on longer stints"
      ],
      "watch_for": "Whether Antonelli keeps it within the white lines at T19 and nails traction off T11 while Mercedes exploits the unlocked parc fermé window to dial in ride height between the Sprint and GP."
    },
    "Fernando Alonso": {
      "tldr": "Alonso arrives in Austin off a solid P7 in Singapore, but the AMR25’s form has swung wildly between tracks. With COTA’s bumps, wind and a Sprint weekend, watch how he balances ride height/kerb usage and uses Saturday’s setup freedom to turn midfield pace into points.",
      "full": "## Current Form\n- Results trend (last 5): Singapore P7, Baku P15 (jump‑start penalty, low pace), Monza DNF (front‑right suspension while running for points), Zandvoort P8, Hungary P5.  \n- Championship picture: Alonso sits 11th on 34 points; Aston Martin are 7th on 66 points after Singapore.  \n- Note: In Singapore he was promoted to P7 after Hamilton’s penalty; he’d topped FP1 and called it “probably the best Friday” of 2025, but still wanted more from the package.",
      "stakes_level": "medium",
      "perfect_quali": "P6–P8",
      "perfect_race": "P6–P8",
      "good_quali": "P9–P12",
      "good_race": "Points finish (P8–P10)",
      "key_strengths": [
        "Tyre management over long stints",
        "late‑braking/racecraft into T1/T12",
        "adaptability in windy/bumpy sections"
      ],
      "watch_for": "How Aston exploits the Sprint-to-GP setup reset — e.g., raising the car after the Sprint to protect the floor/plank while keeping enough bite for the esses."
    },
    "Lance Stroll": {
      "tldr": "Stroll arrives in Austin off a mixed run — P7 at Zandvoort, then P18 Monza, P17 Baku and P13 Singapore — so the target is a clean Sprint and smart tyre use to nick points on Sunday. Watch his traction out of T11 and overtakes into T12, plus how Aston Martin balances ride height and kerb compliance on COTA’s still‑sensitive surface.",
      "full": "## Current Form\n- Last 5 GPs: P14 Belgium, P7 Netherlands, P18 Italy, P17 Azerbaijan, P13 Singapore. It’s an up‑and‑down trend with one strong points finish (Zandvoort) followed by tougher European street/low‑grip venues and a solid if unspectacular Singapore run.  \n- Drivers’ standings after Singapore: Stroll sits on 32 points (13th), with Aston Martin seventh in the Constructors (66). That keeps AMR in a tight midfield fight where every point matters.  \n- Notable 2025 storyline: withdrew from the Spanish GP with wrist/hand pain but returned in June; fitness is no longer an active concern.",
      "stakes_level": "medium",
      "perfect_quali": "P7–P10 (Q3)",
      "perfect_race": "P6–P8",
      "good_quali": "P11–P13",
      "good_race": "Points finish (P9–P10)",
      "key_strengths": [
        "Smooth tyre management over long stints",
        "strong braking/defensive racecraft into T12",
        "tidy laps in fast direction‑change sections"
      ],
      "watch_for": "Whether Aston Martin trim wing and raise ride height to keep the floor safe over bumps/kerbs — and if that trade helps Stroll convert DRS runs into passes at T12 across Sprint and GP."
    },
    "Pierre Gasly": {
      "tldr": "Gasly arrives in Austin on a tough run (P19 Singapore, P16 Monza, P17 Zandvoort) after earlier bright spots at Silverstone (P6) and Spa (P10). Alpine’s target is simple: convert Sprint mileage into a trimmed, compliant race set‑up and sneak points if tyre deg and Safety Cars play their way.",
      "full": "## Current Form\n- Results trend (last five GPs): Singapore P19, Italy P16, Netherlands P17, Hungary P19, Belgium P10.\n- Season picture: Gasly sits on 20 points; Alpine are 10th in the Constructors’ after Singapore. Momentum dipped post‑summer, but the car has shown occasional wet/mixed‑conditions upside.\n- Recent news: Gasly signed a new multi‑year Alpine deal running through 2028, reaffirming he’s the team’s long‑term leader. After Singapore he admitted, “we are not quick or competitive,” underscoring the urgency to find set‑up gains.",
      "stakes_level": "medium",
      "perfect_quali": "P8–P10",
      "perfect_race": "P8–P10 (solid points)",
      "good_quali": "P12–P15 (Q2)",
      "good_race": "P11–P13 (on the cusp of points)",
      "key_strengths": [
        "tyre management in mixed/variable grip",
        "precise rotation through high‑speed direction changes",
        "late‑braking racecraft into T1/T12"
      ],
      "watch_for": "Alpine using the Sprint’s unlocked parc fermé window to soften the car for bumps and rear traction, then a Sunday run at a one‑stop M→H with opportunistic stops if a Safety Car appears."
    },
    "Franco Colapinto": {
      "tldr": "Alpine rookie Franco Colapinto (#43) heads to Austin looking to convert a quietly improving race trend into his first 2025 points. Recent form: P16 in Singapore after qualifying P18; prior results of P19 (Baku), P17 (Monza) and P11 (Zandvoort).",
      "full": "## Current Form\nColapinto comes off P16 in Singapore, having qualified P18 in a tricky weekend for Alpine. Before that he logged P19 (Azerbaijan), P17 (Italy), and P11 (Netherlands) in a car that’s typically been on the Q1/Q2 bubble; he remains on 0 points for 2025. Expect him to target race-day gains rather than pure quali heroics.",
      "stakes_level": "high",
      "perfect_quali": "P11-P13",
      "perfect_race": "Points finish (P9-P10)",
      "good_quali": "P14-P16",
      "good_race": "P11-P13",
      "key_strengths": [
        "Late‑braking overtakes into hairpins",
        "tyre management over long stints",
        "quick adaptation through fast S‑curves"
      ],
      "watch_for": "Whether Alpine nails the ride‑height/traction compromise over COTA’s bumps—if rear stability out of T11 is there, Colapinto can attack into T12."
    },
    "Esteban Ocon": {
      "tldr": "Ocon arrives in Austin off a mixed run but with flashes of pace, and COTA is a place he knows how to hustle late in the race. Watch for Haas to lean on tyre management and use the Sprint-to-GP setup window to tame the bumps and chase points.",
      "full": "## Current Form\nAcross the last five events Ocon scored P10 at Zandvoort, then P15 at Monza, P14 in Baku after a qualifying disqualification, and P18 in Singapore after starting P19; he also banked P5 in the Spa Sprint earlier in the summer. He’s P15 in the Drivers’ standings on 28 points, with Haas ninth on 46 heading to Austin.",
      "stakes_level": "medium",
      "perfect_quali": "P8–P10",
      "perfect_race": "P7–P9",
      "good_quali": "P11–P13",
      "good_race": "Points finish (P9–P10)",
      "key_strengths": [
        "tyre management over long stints",
        "late‑braking consistency into hairpins (T1/T12)",
        "clean lines through fast S‑curves"
      ],
      "watch_for": "Whether Haas and Ocon exploit the Sprint-to-GP parc fermé window to raise the car and stabilize it over the bumps for a stronger Saturday qualifying push."
    },
    "Oliver Bearman": {
      "tldr": "Rookie momentum alert. Bearman arrives off a tidy P9 in Singapore and a standout P6 at Zandvoort, with Haas’ mid‑season upgrade giving him real confidence. Watch how he handles COTA’s S1 “esses” and T19 track limits in a Sprint weekend that rewards fast learning.",
      "full": "## Current Form\n- Results (last 5 GPs): Netherlands P6, Italy P12 (penalty), Azerbaijan P12, Singapore P9. That’s points in 2 of the last 3 Sundays, plus solid race craft in the pack.\n- Standings: 18th on 16 points; Haas sits P9 in Constructors on 46. Recent Singapore P9 nudged both tallies.\n- Quali trend: Broke into Q3 at Singapore (P9), reinforcing the sense that the Silverstone‑spec upgrade has sharpened his one‑lap confidence.",
      "stakes_level": "medium",
      "perfect_quali": "P8–P10",
      "perfect_race": "P6–P8",
      "good_quali": "P11–P14",
      "good_race": "Points finish (P8–P10)",
      "key_strengths": [
        "High‑speed change of direction",
        "braking feel into big stops (T1/T12)",
        "tyre management on Medium/Hard"
      ],
      "watch_for": "Whether Haas adjust the car between Sprint and GP quali to calm the S1 bumps/kerbs without triggering T19 track‑limits issues."
    },
    "Alex Albon": {
      "tldr": "Albon arrives in Austin with solid late-season pace (Spa P6, Zandvoort P5, Monza P7, Suzuka P9) but a messy Singapore (quali DSQ, FP1 brake fire) blunted momentum. If Williams nails ride height and keeps him clean on track limits, top‑eight points in both Sprint and GP are on.",
      "full": "## Current Form\n- Last five races: Belgium P6, Netherlands P5, Italy P7, Japan P9, Singapore P14 (after starting from the back due to a qualifying disqualification). He also lost FP1 time in Singapore to a pit‑lane brake fire. Overall pace trend is positive despite the Singapore setback.  \n- Standings: P8 in the Drivers’ Championship on 70 points; Williams sit P5 in the Constructors.",
      "stakes_level": "medium",
      "perfect_quali": "P6-P8",
      "perfect_race": "P5-P7",
      "good_quali": "P9-P12",
      "good_race": "P8-P10",
      "key_strengths": [
        "High‑speed change of direction",
        "braking/tyre management",
        "straight‑line efficiency and defensive racecraft"
      ],
      "watch_for": "Whether Williams trims wing and gives Albon enough top speed to pass into T12 without triggering T19 track‑limits penalties as tyres fade late."
    },
    "Carlos Sainz": {
      "tldr": "Sainz arrives in Austin on an upswing after a P3 in Baku and a point from the back in Singapore, but COTA’s fast S‑curves will still probe Williams’ long‑corner weakness. If he nails rear‑wing choice and keeps it clean into T1/T12, a solid double-points Sprint/GP haul is on.",
      "full": "## Current Form\n- Last five GPs: Belgium P18, Dutch P13 (10s penalty for a Lawson clash), Italy P11, Azerbaijan P3 (first Williams podium), Singapore P10 from the back after a qualifying DSQ for both Williams cars – strong recovery.  \n- Entered Singapore P12 in the Drivers’ standings on 31 points, then added 1pt; Williams sit P5 in the Constructors on 102 after Singapore. Momentum is trending up since Baku.",
      "stakes_level": "medium",
      "perfect_quali": "P5–P7",
      "perfect_race": "P4–P6 (outside shot at podium with SC/strategy)",
      "good_quali": "P8–P10 (Q3)",
      "good_race": "P6–P8 (points in both Sprint and GP)",
      "key_strengths": [
        "Late‑braking racecraft into T1/T12",
        "tyre management on Medium/Hard",
        "disciplined defensive driving"
      ],
      "watch_for": "Williams’ rear‑wing level choice on Friday (top‑speed vs. S‑sector load) and whether Sainz stays within T19 limits while protecting tyres in the long first‑sector Esses."
    },
    "Liam Lawson": {
      "tldr": "Lawson arrives in Austin on the back of a mixed run — P5 in Baku but only P15 in Singapore after two costly practice crashes. If he keeps it clean on Friday and nails the braking zones at T1/T12, a Q3 cameo and points in both the Sprint and GP are realistic.",
      "full": "## Current Form\n- Last five GPs: Belgium P8, Netherlands P12 (after a mid‑race clash with Sainz), Italy P14, Azerbaijan P5 (career‑best), Singapore P15.\n- Season to date: 30 points, P13–P14 range in the Drivers’ standings; Racing Bulls sit P6 in the Constructors. Momentum ticked up with the Baku P5 after a tough Monza/Singapore.\n- Singapore context: two separate crashes (FP2, FP3) compromised quali prep, and he finished P15 on Sunday. Expect an emphasis on a clean FP1 at COTA.",
      "stakes_level": "medium",
      "perfect_quali": "P7–P9",
      "perfect_race": "P6–P8",
      "good_quali": "P10–P12",
      "good_race": "Points finish (P8–P10)",
      "key_strengths": [
        "Late‑braking/pass execution into T1/T12",
        "tyre management over long stints",
        "adaptable racecraft on evolving surfaces"
      ],
      "watch_for": "A clean FP1 and disciplined Sprint — if he avoids Singapore‑style errors on Friday, Lawson’s Austin race pace historically trends upward, setting him up to convert late into T12."
    },
    "Isack Hadjar": {
      "tldr": "Rookie Hadjar rolls into Austin with real momentum: a maiden podium at Zandvoort, gritty points at Monza and Baku, and just outside the points in Singapore. Expect an aggressive push for Q3 and a tidy, tyre‑smart race as he auditions for a future Red Bull seat.",
      "full": "## Current Form\n- Last 4: Netherlands P3 (first F1 podium), Italy P10 from a pit‑lane start, Azerbaijan P10, Singapore P11. That’s steady scoring form since the summer break, capped by a career‑best at Zandvoort.\n- Season to date: 39 points, P9 in the Drivers’ standings for Racing Bulls (car #6).",
      "stakes_level": "medium",
      "perfect_quali": "P4–P6",
      "perfect_race": "P5–P7",
      "good_quali": "P8–P12",
      "good_race": "Points finish",
      "key_strengths": [
        "high‑speed rhythm through S‑curves",
        "tyre and pace management over long stints",
        "late‑braking racecraft into big stops (T12)"
      ],
      "watch_for": "His consistency through the first‑sector esses and restraint at T19 track limits—if he keeps those tidy, Q3 and Sunday points are on."
    },
    "Nico Hulkenberg": {
      "tldr": "Hulkenberg arrives at COTA needing a reset after a tough Asian/European swing, but his 2025 high points (P3 at Silverstone, P5 in Spain) prove Sauber has peaks to hit. Watch whether he sneaks into Q3 and converts C1/C3/C4 tyre options into a one- or two‑stop points bid on a Sprint weekend.",
      "full": "## Current Form\n- Results last five GPs: Singapore P20; Azerbaijan P16; Italy DNS (hydraulics, formation‑lap); Netherlands P14; Hungary P13. Earlier summer highlight: maiden F1 podium (P3) at Silverstone.  \n- Standings: 10th in Drivers (37 pts); Sauber 8th in Constructors (55 pts). Momentum dipped since the summer upgrades delivered podium/points, so a clean weekend matters.",
      "stakes_level": "medium",
      "perfect_quali": "P7–P10",
      "perfect_race": "P6–P8",
      "good_quali": "P11–P14",
      "good_race": "P9–P10 (points)",
      "key_strengths": [
        "Late‑braking consistency",
        "tyre/pace management in mixed conditions",
        "racecraft in Safety‑Car windows"
      ],
      "watch_for": "Whether Sauber trims ride‑height/kerb use to protect the plank over bumps—after the Bahrain DSQ—and still gives Nico enough front‑end bite through the S‑esses to make Q3 realistic."
    },
    "Gabriel Bortoleto": {
      "tldr": "Rookie Gabriel Bortoleto arrives in Austin off a quietly solid late‑season run, highlighted by points in Hungary and Monza and an 11th in Baku. Watch whether he can convert Sauber’s improved one‑lap form into Sprint points and a GP top‑10 at a wind‑sensitive, newly‑policed COTA.",
      "full": "## Current Form\n- Last five GPs: Belgium P9, Hungary P6 (career‑best), Italy/Monza P8, Azerbaijan P11, Singapore Q: P16, race: outside the points. That’s 18 season points and steady momentum since the summer break.  \n- Championship picture: Bortoleto sits 18th on 18 points; Sauber are 8th on 55 heading into Austin.  \n- Notable 2025 subplot: he clarified a viral Monaco radio clip about Kimi Antonelli as frustration taken out of context; no penalties ensued.",
      "stakes_level": "medium",
      "perfect_quali": "P8–P10 (Q3)",
      "perfect_race": "P6–P8",
      "good_quali": "P11–P14",
      "good_race": "P9–P10 (points)",
      "key_strengths": [
        "tyre management over long stints",
        "clean execution in mixed conditions",
        "disciplined track‑limits awareness"
      ],
      "watch_for": "His consistency through Sector 1’s wind‑sensitive esses and whether he avoids the T19 limits trap while maximizing traction off T11 onto the back straight in both Sprint and GP."
    }
  },
  "top5": [
    {
      "rank": 1,
      "driver": "Oscar Piastri",
      "reason": "Championship leader by 22 points, and COTA’s high‑speed Esses suit the McLaren perfectly. The Sprint format also spotlights McLaren’s team‑orders tension after Singapore.",
      "stakes": "Protect or extend the 22‑point lead with a big Sprint + GP haul to keep Norris (and Verstappen) at bay."
    },
    {
      "rank": 2,
      "driver": "Lando Norris",
      "reason": "Squarely in the title fight and lightning‑quick here (2024 pole), with a redemption arc after last year’s Turn 19 penalty. McLaren’s S‑curve strength gives him double‑winning potential.",
      "stakes": "Cut the 22‑point deficit to Piastri and reassert intra‑team authority with maximum weekend points."
    },
    {
      "rank": 3,
      "driver": "Max Verstappen",
      "reason": "Arrives on form and is a COTA ace (wins in 2022/23, podium 2024); the Sprint rewards his medium/hard race pace. He’ll pounce if McLaren slip on bumps or track limits.",
      "stakes": "Keep realistic title hopes alive by outscoring both McLarens and banking bonus Sprint points."
    },
    {
      "rank": 4,
      "driver": "George Russell",
      "reason": "Fresh off a statement win in Singapore (plus Canada earlier), Mercedes’ upswing makes him a live threat if he nails Turn 19 discipline and the bumps. T1/T12 heavy‑brake zones play to his strengths across both races.",
      "stakes": "Chase back‑to‑back wins, cement Mercedes’ late‑season resurgence, and bank a marquee points haul."
    },
    {
      "rank": 5,
      "driver": "Charles Leclerc",
      "reason": "Defending Austin winner (2024) with sharp tyre management; Ferrari can use the Sprint‑to‑GP setup reset to target a podium from a modest baseline. He’s the yardstick for maximizing results here.",
      "stakes": "Podium—if not an opportunistic win—to anchor Ferrari’s weekend and assert intra‑team edge over Hamilton."
    }
  ],
  "underdogs": [
    {
      "driver": "Oliver Bearman",
      "title": "Rookie Haas hero in home upset",
      "story": "Off a tidy P9 in Singapore and a standout P6 at Zandvoort, Bearman and Haas’ mid‑season upgrade arrive with quiet momentum. Sprint mileage plus setup freedom between the Sprint and GP qualifying can help him master COTA’s bumps and T19 limits in front of the team’s home crowd.",
      "surprise_factor": "Sprint‑to‑GP setup flexibility and improved kerb compliance could let Haas dial in ride height; Bearman’s fast learning curve can turn mid‑grid pace into top‑eight points."
    },
    {
      "driver": "Yuki Tsunoda",
      "title": "Turn 19 tamer with quiet speed",
      "story": "Austin has been kind to Tsunoda—he even set fastest lap here in 2023—and he arrives with flashes despite a mixed run. Extra Sprint mileage should sharpen qualifying consistency, and disciplined T19 laps could put him on an unexpectedly strong grid slot.",
      "surprise_factor": "COTA comfort plus medium/hard race focus and clean exits from T11 onto the back straight could translate into Q3 and a serious points haul."
    },
    {
      "driver": "Franco Colapinto",
      "title": "Rookie hunts first points under Texas sun",
      "story": "The Alpine rookie’s form is quietly trending upward, and COTA’s long S‑curves and bumps should reward a trimmed, compliant setup he can dial in over Sprint mileage. With Safety Cars a recurring Austin theme, one well‑timed stop could turn first‑points hopes into reality.",
      "surprise_factor": "Short ~20‑second pit‑lane loss and C1/C3/C4 flexibility open strategic windows; if Alpine nails ride height over the bumps, he can sneak into the top ten."
    }
  ],
  "raceContext": "United States GP (Circuit of the Americas) – race-weekend context\nEvent dates: Friday–Sunday, October 17–19, 2025 (Austin, Texas). Sprint weekend format. Grand Prix start: Sunday 14:00 local (UTC‑5). Key F1 sessions: FP1 Fri 12:30–13:30; Sprint Qualifying Fri 16:30; Sprint Sat 12:00; Grand Prix Qualifying Sat 16:00.\n\nWeather (latest outlook for race weekend – Austin, TX)\nNote: this is a long‑range outlook (issued Oct 5) and confidence will increase inside 5 days.\n- Friday (Oct 17): Partly sunny; high ~81°F/27°C, low ~55°F/13°C. \n- Saturday (Oct 18): Mostly sunny and warm; high ~85°F/29°C, low ~60°F/16°C. \n- Sunday (Oct 19 – race): Mostly sunny, warm; high ~84°F/29°C, low ~58°F/14°C. \n- Wind and rain probability: Early long‑range guidance points to light southerly breezes around 7–12 mph and low precipitation odds; typical October wind in Austin averages ~7 mph. We’ll refine gusts/PoP mid‑week.\n\nTrack characteristics and key corners\n- 5.513 km, anti‑clockwise, 20 turns; signature 41 m (≈134 ft) climb to Turn 1 hairpin. First sector “esses” (T3‑6) echo Silverstone/Suzuka; heavy‑brake pass into T12 at end of the long back straight; multi‑apex T16‑18 and track‑limits hotspot at T19. Two DRS zones (runs to T1 and T12).\n- Surface/limits updates: large portions were resurfaced ahead of 2024 and “fake gravel” added at some corners to curb track‑limits abuse; resurfacing sought to smooth long‑standing bumps.\n- Local notes: COTA is wind‑sensitive and punishing on lateral load through the fast S‑curves; traction critical out of T11 onto the back straight.\n\nHistorical Safety Car/incident profile\n- Full Safety Car deployed in 2013 (Lap 1), 2014 (Lap 1), 2015 (Laps 27 & 43), 2022 (Laps 18 & 22), and 2024 (Lap 2). VSCs in 2015, 2016, 2018, 2021. No red‑flagged USGP at COTA to date.\n\nStrategy considerations\n- Tyre compounds (2025): Pirelli has nominated C1 (Hard), C3 (Medium), C4 (Soft) for Austin, skipping C2. Expect meaningful pace gap between compounds and some setup trade‑offs across Sprint/GP.\n- Pit lane loss: ~20 seconds; short delta lends flexibility for two‑stop responses to deg or Safety Car.\n- Likely race plans: Historically variable. COTA often trends to 2‑stop on C2/C3/C4 with soft of limited race use, but a one‑stop can win if temps and degradation cooperate (Ferrari did so in 2024). Teams typically start on Medium and extend to open options; Hards favored for long stints.\n- Sprint parc fermé: In 2025 the Sprint is a standalone event with parc fermé “unlocked” between the Sprint and Saturday GP qualifying, allowing setup changes; cars are otherwise locked from Sprint Qualifying through the Sprint and again from GP Qualifying to the race. This eases some 2023‑style setup traps on bumpy surfaces.\n\nRecent race history at COTA (last 3 editions)\n- 2024: Charles Leclerc won (Ferrari) from Carlos Sainz; Max Verstappen P3 after Lando Norris received a 5s penalty. Largely one‑stop strategies; Safety Car on Lap 2. Pole: Norris. Fastest lap: Esteban Ocon.\n- 2023: Max Verstappen won (Red Bull). Lewis Hamilton (P2 on road) and Charles Leclerc (P6) were disqualified post‑race for plank wear amid bumpy surface/Sprint‑weekend setup constraints.\n- 2022: Max Verstappen won (Red Bull) from Hamilton and Leclerc in a two‑Safety‑Car race.\n\nUnique challenges for teams and drivers\n- Bumps and compliance: Despite resurfacing, ride‑height/window sensitivity remains a theme; 2023 DSQs underscored risk around skid‑block wear when parc fermé restricts changes.\n- Wind and track limits: Crosswinds through the first‑sector S‑curves can destabilize balance; T19 and T12 are frequent limits hotspots.\n- Thermal degradation: Long, high‑speed sequences load the fronts; traction demands out of T11/T20 stress rears, pushing teams toward Medium/Hard focus and careful energy management.\n\nPractice/qualifying status (as of Sunday, Oct 5, 2025)\n- No Austin sessions yet. Next F1 on‑track is FP1 in Austin on Friday, Oct 17. It is a Sprint weekend (Sprint Qualifying Friday; Sprint Saturday noon local).\n\nLatest F1 form guide and news heading into Austin\n- Singapore GP (Oct 5): George Russell won for Mercedes ahead of Max Verstappen; Lando Norris P3. McLaren clinched the 2025 Constructors’ Championship with six rounds remaining; in Drivers’, Oscar Piastri leads Norris by 22 points, Verstappen further back. Austin is next.\n- Austin 2025 is a Sprint event per the official 2025 Sprint calendar, with the detailed session timetable published (see above).\n\nQuick reference – overtaking and operations\n- Primary passing: DRS to T12 (best), plus T1 hairpin; 78 race‑overtakes were logged in 2023. Pit loss ≈20.3 s; 2 DRS zones.\n\nIf you’d like, I can refresh the forecast mid‑week (Oct 13–15) to add precise wind/PoP/gusts and update Sprint/GP tyre usage once Pirelli’s pre‑event notes land.",
  "metadata": {
    "circuit": "circuit of the americas",
    "date": "2025-10-19",
    "season": "2025",
    "generatedAt": null
  }
}